# KipsPerCubicInch Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..KipsPerCubicInch Property
UnitTypeId Class See Also
---
Kips per cubic inch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KipsPerCubicInch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KipsPerCubicInch As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KipsPerCubicInch {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace